Revit 2026 API

# LevelAssociationDataGetLevelAssociationData Method

---

Returns LevelAssociationData associated with this element, if it exists.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static LevelAssociationData GetLevelAssociationData(
	Element element
)
```
```vb
Public Shared Function GetLevelAssociationData (
	element As Element
) As LevelAssociationData
```
```cpp
public:
static LevelAssociationData^ GetLevelAssociationData(
	Element^ element
)
```
```fsharp
static member GetLevelAssociationData :
        element : Element -> LevelAssociationData
```

#### Parameters

element Element
     The element from which we try to obtain LevelAssociationData.

#### Return Value

LevelAssociationData

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the input element doesn't have LevelAssociationData than it retuns .

#### Reference

LevelAssociationData Class

Autodesk.Revit.DB Namespace